[
  {
    "name": "Casual Sneaker",
    "company": "BATA",
    "price": 150,
    "discount": 25,
    "colors": ["#AB9787", "#f5f5dc"],
    "image": "https://www.batabd.com/cdn/shop/files/1_9c79c151-a8fc-4071-a5e4-9867011bc468_300x.jpg?v=1703144431",
    "description": "Elevate Your Casual Style with Bata's Contemporary Sneakers!!! Rediscover the essence of casual style with these modern and stylish sneakers from Bata. Designed with a premium suede synthetic and PU upper, and a high-quality TPU sole, these shoes strike the perfect balance between fashion and functionality. Lightweight, comfortable, and durable, these lace-up sneakers are tailored for men who prioritize style even in their everyday activities. Whether you're at work, engaged in play, or socializing, this Bata casual sneaker is versatile enough for all occasions.",
    "sizes": [9, 10, 12]
  },
  {
    "name": "Hush Puppies Sneaker ",
    "company": "BATA",
    "price": 600,
    "discount": 10,
    "colors": ["#FFFFFF", "#000000"],
    "image": "https://www.batabd.com/cdn/shop/files/1_38594a88-9473-4dae-a49d-427432a1cede_300x.jpg?v=1702458320",
    "description": "Introducing our newest HUSH PUPPIES sneaker featuring MEGAbounce !! Wear comfort, meet every movement with this MEGAbounce sneaker! Maximum Cushy Outsole: The ultra-soft MEGAbounce outsole is made from ultra-soft foam that provides instant underfoot comfort when worn. Instant Gooshy Comfort: The newly-developed BounceTM foot pads are made with foam for an instant soft touch and lasting all day. What's more, this new foam is made from 20% natural materials and 5% recycled materials* to help reduce the environmental impact. (*20-25% soy or sesame oil, 5-10% recycled rubber.",
    "sizes": [8, 11, 10]
  },

  {
    "name": "Weinbrenner Sandal",
    "company": "Apx",
    "price": 499,
    "discount": 15,
    "colors": ["#000", "#8d9ba8"],
    "image": "https://www.batabd.com/cdn/shop/products/1_708d5c1a-8430-4702-b87a-289aee593c6a_300x.jpg?v=1586412766",
    "description": "Kickstart your summer style with this thong sandal from Weinbrenner. A supportive footbed & traction sole will make this flip flop your new go-to when the temperatures rise.",
    "sizes": [10, 12, 13]
  },
  {
    "name": "Formal Shoe",
    "company": "Apx",
    "price": 429,
    "discount": 40,
    "colors": ["##bba25e", "#000000"],
    "image": "https://www.batabd.com/cdn/shop/products/1_14431d83-46b5-4e5c-8345-efd51b2baf7b_300x.jpg?v=1661420526",
    "description": "Introducing Hush Puppies' exquisite lace-up formal shoe for men, a symbol of refined elegance and impeccable craftsmanship. These shoes are meticulously designed to provide the utmost comfort while exuding sophistication and style, making them a perfect choice for any formal occasion. The upper of these premium formal shoes is expertly crafted using genuine leather, renowned for its luxurious texture and durability. The rich, supple leather not only enhances the shoe's visual appeal but also ensures a comfortable fit that molds to your feet over time. The attention to detail in the stitching and finishing elevates these shoes to a class of their own. For superior traction and flexibility, these formal shoes feature a TPR outsole. Whether you're attending a business meeting, a wedding, or a black-tie event, these formals will provide stability and support throughout the day or evening.",
    "sizes": [14, 15, 16]
  }
]
